Results/Verifications/S2427/update_index/tidb-server-rv64gcv_zfh_xtheadba_xtheadcondmov_xtheadmac.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 2700.59 qps: 2700.59 (r/w/o: 0.00/2635.32/65.27) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 2827.00 qps: 2827.00 (r/w/o: 0.00/2761.60/65.40) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 2795.90 qps: 2795.90 (r/w/o: 0.00/2728.00/67.90) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 2859.24 qps: 2859.24 (r/w/o: 0.00/2789.83/69.40) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 2876.69 qps: 2876.69 (r/w/o: 0.00/2804.99/71.70) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 2871.98 qps: 2871.98 (r/w/o: 0.00/2798.99/73.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 2839.42 qps: 2839.42 (r/w/o: 0.00/2767.92/71.50) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 2874.81 qps: 2874.81 (r/w/o: 0.00/2801.91/72.90) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 2825.97 qps: 2825.97 (r/w/o: 0.00/2757.27/68.70) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 2903.71 qps: 2903.71 (r/w/o: 0.00/2831.11/72.60) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 2738.01 qps: 2738.01 (r/w/o: 0.00/2668.91/69.10) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 2608.92 qps: 2608.92 (r/w/o: 0.00/2545.52/63.40) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 2834.47 qps: 2834.47 (r/w/o: 0.00/2764.47/70.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 2531.69 qps: 2531.69 (r/w/o: 0.00/2471.19/60.50) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 2544.80 qps: 2544.80 (r/w/o: 0.00/2486.20/58.60) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 2890.54 qps: 2890.54 (r/w/o: 0.00/2818.14/72.40) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 2803.79 qps: 2803.79 (r/w/o: 0.00/2736.79/67.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 2824.70 qps: 2824.70 (r/w/o: 0.00/2753.90/70.80) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 2862.82 qps: 2862.82 (r/w/o: 0.00/2792.32/70.50) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 2790.87 qps: 2790.87 (r/w/o: 0.00/2721.47/69.40) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 2872.01 qps: 2872.01 (r/w/o: 0.00/2798.11/73.90) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 2958.89 qps: 2958.89 (r/w/o: 0.00/2881.09/77.80) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 2857.61 qps: 2857.61 (r/w/o: 0.00/2781.11/76.50) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 2758.68 qps: 2758.68 (r/w/o: 0.00/2691.48/67.20) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 2811.83 qps: 2811.83 (r/w/o: 0.00/2740.03/71.80) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 2804.06 qps: 2804.06 (r/w/o: 0.00/2735.06/69.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 2761.23 qps: 2761.23 (r/w/o: 0.00/2691.13/70.10) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 2708.11 qps: 2708.11 (r/w/o: 0.00/2641.31/66.80) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 2792.80 qps: 2792.80 (r/w/o: 0.00/2724.00/68.80) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 2508.80 qps: 2508.80 (r/w/o: 0.00/2443.30/65.50) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 2468.88 qps: 2468.88 (r/w/o: 0.00/2409.58/59.30) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 2709.03 qps: 2709.03 (r/w/o: 0.00/2644.13/64.90) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 2766.19 qps: 2766.19 (r/w/o: 0.00/2693.39/72.80) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 2835.57 qps: 2835.57 (r/w/o: 0.00/2761.96/73.60) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 2768.70 qps: 2768.70 (r/w/o: 0.00/2700.30/68.40) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 2833.39 qps: 2833.39 (r/w/o: 0.00/2764.99/68.40) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 2752.17 qps: 2752.17 (r/w/o: 0.00/2689.07/63.10) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 2814.98 qps: 2814.98 (r/w/o: 0.00/2743.88/71.10) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 2733.49 qps: 2733.49 (r/w/o: 0.00/2665.19/68.30) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 2858.59 qps: 2858.59 (r/w/o: 0.00/2791.69/66.90) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 2763.83 qps: 2763.83 (r/w/o: 0.00/2694.52/69.30) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 2817.97 qps: 2817.97 (r/w/o: 0.00/2753.67/64.30) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 2775.71 qps: 2775.71 (r/w/o: 0.00/2715.21/60.50) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 2956.42 qps: 2956.42 (r/w/o: 0.00/2881.82/74.60) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 2678.19 qps: 2678.19 (r/w/o: 0.00/2610.69/67.50) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 2332.10 qps: 2332.10 (r/w/o: 0.00/2275.10/57.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 2465.69 qps: 2465.69 (r/w/o: 0.00/2400.49/65.20) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 2816.71 qps: 2816.71 (r/w/o: 0.00/2746.61/70.10) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 2706.40 qps: 2706.40 (r/w/o: 0.00/2644.00/62.40) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 2847.49 qps: 2847.49 (r/w/o: 0.00/2775.69/71.80) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 2773.91 qps: 2773.91 (r/w/o: 0.00/2704.41/69.50) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 2861.10 qps: 2861.10 (r/w/o: 0.00/2790.60/70.50) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 2736.60 qps: 2736.60 (r/w/o: 0.00/2673.50/63.10) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 2835.11 qps: 2835.11 (r/w/o: 0.00/2764.81/70.30) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 2771.49 qps: 2771.49 (r/w/o: 0.00/2706.19/65.30) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 2782.92 qps: 2782.92 (r/w/o: 0.00/2711.81/71.10) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 2800.28 qps: 2800.28 (r/w/o: 0.00/2733.88/66.40) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 2485.01 qps: 2485.01 (r/w/o: 0.00/2424.41/60.60) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 2803.52 qps: 2803.52 (r/w/o: 0.00/2739.82/63.70) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 2592.53 qps: 2592.53 (r/w/o: 0.00/2526.13/66.40) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1617026
        other:                           40839
        total:                           1657865
    transactions:                        1657865 (2763.06 per sec.)
    queries:                             1657865 (2763.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0068s
    total number of events:              1657865

Latency (ms):
         min:                                    1.11
         avg:                                    4.34
         max:                                  272.79
         95th percentile:                        7.43
         sum:                              7197027.54

Threads fairness:
    events (avg/stddev):           138155.4167/100.55
    execution time (avg/stddev):   599.7523/0.00